plantuml-editor-1c/src/ExternalDataProcessors/PlantUMLEditor/PlantUMLEditor.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>PlantUMLEditor</name>
  <comment>Инструмент позволяет создавать и редактировать UML-схемы с визуализацией результата.</comment>
  <tabularSections>
    <name>СвойстваДиаграмм</name>
    <attributes>
      <name>Диаграмма</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диаграмма</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваСвязей</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диаграмма</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваГрупп</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диаграмма</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Диаграммы</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОписаниеСвязейДиаграмм</name>
    <attributes>
      <name>Диаграмма</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриемникСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКМетаданным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

plantuml-editor-1c/src/ExternalDataProcessors/PlantUMLEditor/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получение списка доступных типов диаграмм.
// 
// Возвращаемое значение:
//  Соответствие - Доступные типы диаграмм
//@skip-check doc-comment-collection-item-type
Функция ДоступныеТипыДиаграмм() Экспорт

	ТипыДиаграмм = Новый Структура();

	ТипыДиаграмм.Вставить(
		"ДиаграммаКлассов",
		Новый Структура(
			"Имя,Представление",
			"ДиаграммаКлассов",
			НСтр("ru = 'Диаграмма классов';
				|en = 'Class diagram'")));

	ТипыДиаграмм.Вставить(
		"ДиаграммаДеятельности",
		Новый Структура(
			"Имя,Представление",
			"ДиаграммаДеятельности",
			НСтр("ru = 'Диаграмма деятельности';
				|en = 'Activity diagram'")));

	ТипыДиаграмм.Вставить(
		"ДиаграммаПоследовательностей",
		Новый Структура(
			"Имя,Представление",
			"ДиаграммаПоследовательностей",
			НСтр("ru = 'Диаграмма последовательностей';
				|en = 'Sequence diagram'")));

	Возврат ТипыДиаграмм;

КонецФункции

// Получение свойств диаграммы и ее составляющих.
// 
// Параметры:
//  ТипДиаграммы - Строка - Тип диаграммы, для получения свойств.
//  ВидСвойств - Строка, Неопределено - Ключ свойства для получения.
// 
// Возвращаемое значение:
//  Структура - Информация о свойствах диаграммы.
Функция СвойстваПоДиаграмме(ТипДиаграммы, ВидСвойств = Неопределено) Экспорт

	Результат = Новый Структура();

	Если ВидСвойств = Неопределено Тогда
		ВидСвойств = "ВсеСвойства";
	КонецЕсли;

	НеобходимыСвойстваДиаграммы = Новый Массив();
	НеобходимыСвойстваДиаграммы.Добавить("ВсеСвойства");
	НеобходимыСвойстваДиаграммы.Добавить("СвойстваДиаграммы");
	
	Если НеобходимыСвойстваДиаграммы.Найти(ВидСвойств) <> Неопределено Тогда

		Результат.Вставить("СвойстваДиаграммы", СвойстваДиаграммы(ТипДиаграммы));

	КонецЕсли;

	НеобходимыСвойстваГруппы = Новый Массив();
	НеобходимыСвойстваГруппы.Добавить("ВсеСвойства");
	НеобходимыСвойстваГруппы.Добавить("СвойстваГруппы");

	Если НеобходимыСвойстваГруппы.Найти(ВидСвойств) <> Неопределено Тогда

		Результат.Вставить("СвойстваГруппы", СвойстваГруппы(ТипДиаграммы));

	КонецЕсли;

	НеобходимыСвойстваОбъекта = Новый Массив();
	НеобходимыСвойстваОбъекта.Добавить("ВсеСвойства");
	НеобходимыСвойстваОбъекта.Добавить("СвойстваОбъекта");

	Если НеобходимыСвойстваОбъекта.Найти(ВидСвойств) <> Неопределено Тогда

		Результат.Вставить("СвойстваОбъекта", СвойстваОбъекта(ТипДиаграммы));

	КонецЕсли;

	НеобходимыСвойстваОбъекта = Новый Массив();
	НеобходимыСвойстваОбъекта.Добавить("ВсеСвойства");
	НеобходимыСвойстваОбъекта.Добавить("СвойстваСвязи");

	Если НеобходимыСвойстваОбъекта.Найти(ВидСвойств) <> Неопределено Тогда

		Результат.Вставить("СвойстваСвязи", СвойстваСвязи(ТипДиаграммы));

	КонецЕсли;

	//@skip-check constructor-function-return-section
	Возврат Результат;

КонецФункции // СвойстваПоДиаграмме()

// Формирование отбора по таблице свойств.
// 
// Параметры:
//  ИмяТаблицы - Строка - Идентификатор таблицы, для которой формируется запрос.
//  ПараметрОтбора - Строка - Вид группы свойств.
//  Диаграмма - Строка - Текущая диаграмма.
//  ТипДиаграммы - Строка - Тип текущей диаграммы.
// 
// Возвращаемое значение:
//  Структура - Отбор свойств по таблице:
// * Диаграмма - Строка.
// * ТипДиаграммы - Строка.
// * Объект - Строка.
Функция ОтборСвойствПоТаблице(ИмяТаблицы, ПараметрОтбора, Диаграмма, ТипДиаграммы) Экспорт

	ОтборСвойств = Новый Структура();

	Если ИмяТаблицы = "СвойстваДиаграмм" Тогда
		ОтборСвойств.Вставить("Диаграмма", ПараметрОтбора);
		ОтборСвойств.Вставить("ТипДиаграммы", ТипДиаграммы);
	ИначеЕсли ИмяТаблицы = "СвойстваОбъектов" Тогда
		ОтборСвойств.Вставить("Диаграмма", Диаграмма);
		ОтборСвойств.Вставить("ТипДиаграммы", ТипДиаграммы);
		ОтборСвойств.Вставить("Объект", ПараметрОтбора);
	ИначеЕсли ИмяТаблицы = "СвойстваСвязей" Тогда
		ОтборСвойств.Вставить("Диаграмма", Диаграмма);
		ОтборСвойств.Вставить("ТипДиаграммы", ТипДиаграммы);
		ОтборСвойств.Вставить("Ключ", ПараметрОтбора);
	ИначеЕсли ИмяТаблицы = "СвойстваГрупп" Тогда
		ОтборСвойств.Вставить("Диаграмма", Диаграмма);
		ОтборСвойств.Вставить("ТипДиаграммы", ТипДиаграммы);
		ОтборСвойств.Вставить("Объект", ПараметрОтбора);
	КонецЕсли;

	Возврат ОтборСвойств;

КонецФункции // ОтборСвойствПоТаблице()

// Проверка того, передаваемая диаграмма соответствует необходимой.
// 
// Параметры:
//  ТипДиаграммы - Строка - Тип текущей диаграммы.
//  ТипДиаграммыПроверки - Строка - Тип диаграммы для проверки.
// 
// Возвращаемое значение:
//  Булево - Признак того, что совпали диаграммы.
Функция ТипДиаграммыСовпадает(ТипДиаграммы, ТипДиаграммыПроверки) Экспорт

	Возврат ТипДиаграммы = ДоступныеТипыДиаграмм()[ТипДиаграммыПроверки].Имя;

КонецФункции // ТипДиаграммыСовпадает()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - сведения о внешней обработке.
//
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",                "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование",       ЭтотОбъект.Метаданные().Синоним);
	ПараметрыРегистрации.Вставить("Версия",             "1.0.2.1");
	ПараметрыРегистрации.Вставить("Информация",         ЭтотОбъект.Метаданные().Комментарий);
	ПараметрыРегистрации.Вставить("Авторы",             НСтр("ru = 'Цюпцюн Антон';
															|en = 'Qiupqiong Anton'"));
	ПараметрыРегистрации.Вставить("РепозиторийПроекта", "https://github.com/rarus/plantuml-editor-1c");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);

	Команды = Новый ТаблицаЗначений();
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	НоваяСтрока = Команды.Добавить();
	НоваяСтрока.Идентификатор = ЭтотОбъект.Метаданные().Имя;
	НоваяСтрока.Представление = ПараметрыРегистрации.Наименование;
	НоваяСтрока.Использование = "ОткрытиеФормы";

	ПараметрыРегистрации.Вставить("Команды", Команды);

	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализацияСвойств()

	Свойства = Новый ТаблицаЗначений();
	Свойства.Колонки.Добавить("Свойство", Новый ОписаниеТипов("Строка"));
	Свойства.Колонки.Добавить("ТипДиаграммы", Новый ОписаниеТипов("Строка"));
	Свойства.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Свойства.Колонки.Добавить("ТипЗначения");
	Свойства.Колонки.Добавить("ДоступныеЗначения", Новый ОписаниеТипов("СписокЗначений"));
	Свойства.Колонки.Добавить("ТолькоДоступныеЗначения", Новый ОписаниеТипов("Булево"));
	Свойства.Колонки.Добавить("ОграничениеИспользования", Новый ОписаниеТипов("Строка"));

	Возврат Свойства;

КонецФункции // ИнициализацияСвойств()

Функция СвойстваДиаграммы(ТипДиаграммы)

	Свойства = ИнициализацияСвойств();

	ПолучитьСвойстваДиаграммыПоследовательностей(ТипДиаграммы, Свойства);
	ПолучитьСвойстваДиаграммыКлассов(ТипДиаграммы, Свойства);
	ПолучитьСвойстваДиаграммыДеятельности(ТипДиаграммы, Свойства);

	Возврат Свойства;

КонецФункции // СвойстваДиаграммы()

Функция СвойстваГруппы(ТипДиаграммы)

	Свойства = ИнициализацияСвойств();

	ПолучитьСвойстваГруппыПоследовательностей(ТипДиаграммы, Свойства);
	ПолучитьСвойстваГруппыКлассов(ТипДиаграммы, Свойства);
	ПолучитьСвойстваГруппыДеятельности(ТипДиаграммы, Свойства);

	Возврат Свойства;

КонецФункции // СвойстваГруппы()

Функция СвойстваОбъекта(ТипДиаграммы)

	Свойства = ИнициализацияСвойств();

	ПолучитьСвойстваОбъектаПоследовательностей(ТипДиаграммы, Свойства);
	ПолучитьСвойстваОбъектаКлассов(ТипДиаграммы, Свойства);
	ПолучитьСвойстваОбъектаДеятельности(ТипДиаграммы, Свойства);

	Возврат Свойства;

КонецФункции // СвойстваОбъекта()

Функция СвойстваСвязи(ТипДиаграммы)

	Свойства = ИнициализацияСвойств();

	ПолучитьСвойстваСвязиПоследовательностей(ТипДиаграммы, Свойства);
	ПолучитьСвойстваСвязиКлассов(ТипДиаграммы, Свойства);
	ПолучитьСвойстваСвязиДеятельности(ТипДиаграммы, Свойства);

	Возврат Свойства;

КонецФункции // СвойстваСвязи()

#Область ДиаграммаПоследовательностей

Процедура ПолучитьСвойстваДиаграммыПоследовательностей(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаПоследовательностей") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"autonumber",
		НСтр("ru = 'Автонумерация сообщений с номера';
			|en = 'Auto-numbering of messages from a number'"),
		Новый ОписаниеТипов("Число"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"header",
		НСтр("ru = 'Текст верхнего колонтитула страницы';
			|en = 'The page header text'"),
		Новый ОписаниеТипов("Строка"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"footer",
		НСтр("ru = 'Текст нижнего колонтитула страницы';
			|en = 'The page footer text'"),
		Новый ОписаниеТипов("Строка"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"hide footbox",
		НСтр("ru = 'Удалить нижний колонтитул объектов';
			|en = 'Delete the footer of objects'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"hide unlinked",
		НСтр("ru = 'Скрыть не связанных участников';
			|en = 'Hide unrelated members'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"mainframe",
		НСтр("ru = 'Название основной области';
			|en = 'Name of the main area'"),
		Новый ОписаниеТипов("Строка"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"!pragma teoz",
		НСтр("ru = 'Использовать новую архитектуру uml ""Teoz""';
			|en = 'Use the new uml architecture ""Teoz""'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ФорматКартинкиРезультата",
		НСтр("ru = 'Формат картинки результата';
			|en = 'Result image format'"),
		Новый ОписаниеТипов("Строка"),
		ФорматыКартинкиРезультата());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam sequenceArrowThickness",
		НСтр("ru = 'Толщина стрелок';
			|en = 'Thickness of the arrows'"),
		Новый ОписаниеТипов("Число"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam roundcorner",
		НСтр("ru = 'Закругление углов';
			|en = 'Rounding the corners'"),
		Новый ОписаниеТипов("Число"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam maxmessagesize",
		НСтр("ru = 'Максимальный размер сообщения, в пикселях';
			|en = 'Maximum message size, in pixels'"),
		Новый ОписаниеТипов("Число"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam sequenceParticipant",
		НСтр("ru = 'Подчеркивать имена объектов';
			|en = 'Underline the names of objects'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("underline", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam guillemet",
		НСтр("ru = 'Не преобразовывать символы ""<<"" и "">>"" в ""«"" и ""»""';
			|en = 'Do not convert the characters ""<<"" and "">>"" to """""" and """"""'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("false", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam backgroundColor",
		НСтр("ru = 'Цвет фона';
			|en = 'Background color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam handwritten",
		НСтр("ru = 'Изображать схему в стиле ""от руки""';
			|en = 'Draw a diagram in the ""freehand"" style'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam ParticipantPadding",
		НСтр("ru = 'Размер отступа от участников, в пикселях';
			|en = 'The size of the margin from the participants, in pixels'"),
		Новый ОписаниеТипов("Число"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam BoxPadding",
		НСтр("ru = 'Расстояние в пикселях слева и справа от поля';
			|en = 'The distance in pixels to the left and right of the field'"),
		Новый ОписаниеТипов("Число"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam lifelineStrategy",
		НСтр("ru = 'Вертикальные линии сплошные';
			|en = 'Vertical lines are solid'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("solid", "nosolid"));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam style",
		НСтр("ru = 'Отображать в строгом соответствии с UML';
			|en = 'Display in strict accordance with UML'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("strictuml", ""));
	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam sequenceMessageAlign",
		НСтр("ru = 'Расположение текста относительно стрелки';
			|en = 'The location of the text relative to the arrow'"),
		Новый ОписаниеТипов("Строка"),
		СписокВыбораРасположения(),
		Истина);

	Свойства.Сортировать("Наименование");

КонецПроцедуры // ПолучитьСвойстваДиаграммыПоследовательностей()

Процедура ПолучитьСвойстваГруппыПоследовательностей(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаПоследовательностей") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветФона",
		НСтр("ru = 'Цвет фона';
			|en = 'Background color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

КонецПроцедуры // ПолучитьСвойстваГруппыПоследовательностей()

Процедура ПолучитьСвойстваОбъектаПоследовательностей(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаПоследовательностей") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипОбъекта",
		НСтр("ru = 'Тип объекта (диаграмма последовательностей)';
			|en = 'Object type (sequence diagram)'"),
		Новый ОписаниеТипов("Строка"),
		ФормаПредставленияОбъекта());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветФона",
		НСтр("ru = 'Цвет объекта';
			|en = 'Object color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

КонецПроцедуры // ПолучитьСвойстваОбъектаПоследовательностей()

Процедура ПолучитьСвойстваСвязиПоследовательностей(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаПоследовательностей") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипСтрелки",
		НСтр("ru = 'Тип стрелки';
			|en = 'Arrow Type'"),
		Новый ОписаниеТипов("Строка"),
		ТипыСтрелок(),
		Истина);

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ПунктирнаяСтрелка",
		НСтр("ru = 'Выводить связь пунктирной стрелкой';
			|en = 'Display the relationship with a dotted arrow'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", "false"));	

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветСтрелки",
		НСтр("ru = 'Цвет линии';
			|en = 'Line color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"АктивацияИсточника",
		НСтр("ru = 'Активация объекта-источника';
			|en = 'Activating the source object'"),
		Новый ОписаниеТипов("Строка"),
		ТипыАктивизацииОбъектов(),
		Истина);

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"АктивацияПриемника",
		НСтр("ru = 'Активация объекта-приемника';
			|en = 'Activating the receiver object'"),
		Новый ОписаниеТипов("Строка"),
		ТипыАктивизацииОбъектов(),
		Истина);

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ВидСообщения",
		НСтр("ru = 'Вид связи';
			|en = 'Type of connection'"),
		Новый ОписаниеТипов("Строка"),
		ВидыСообщений());

КонецПроцедуры // ПолучитьСвойстваСвязиПоследовательностей()

#КонецОбласти

#Область ДиаграммаКлассов

Процедура ПолучитьСвойстваДиаграммыКлассов(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаКлассов") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam backgroundColor",
		НСтр("ru = 'Цвет фона';
			|en = 'Background color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam ArrowColor",
		НСтр("ru = 'Цвет стрелок';
			|en = 'The color of the arrows'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam classBackgroundColor",
		НСтр("ru = 'Цвет фона классов';
			|en = 'Class background color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam groupInheritance",
		НСтр("ru = 'Максимальное количество объединения окончаний стрелок к классу';
			|en = 'The maximum number of combining arrow endings to a class'"),
		Новый ОписаниеТипов("Число"));

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ФорматКартинкиРезультата",
		НСтр("ru = 'Формат картинки результата';
			|en = 'Result image format'"),
		Новый ОписаниеТипов("Строка"),
		ФорматыКартинкиРезультата());

КонецПроцедуры // ПолучитьСвойстваДиаграммыКлассов()

Процедура ПолучитьСвойстваОбъектаКлассов(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаКлассов") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипОбъекта",
		НСтр("ru = 'Тип объекта (диаграмма классов)';
			|en = 'Object type (class diagram)'"),
		Новый ОписаниеТипов("Строка"),
		ФормаПредставленияОбъектаКласса());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"Дженерик",
		НСтр("ru = 'Дополнительное описание';
			|en = 'Additional description'"),
		Новый ОписаниеТипов("Строка"));	

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветФона",
		НСтр("ru = 'Цвет объекта';
			|en = 'Object color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

КонецПроцедуры // ПолучитьСвойстваОбъектаПоследовательностей()

Процедура ПолучитьСвойстваСвязиКлассов(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаКлассов") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипСвязи",
		НСтр("ru = 'Тип связи';
			|en = 'Type of connection'"),
		Новый ОписаниеТипов("Строка"),
		ТипыСвязейКлассов(),
		Истина);

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"НаконечникИсточника",
		НСтр("ru = 'Наконечник стрелки источника';
			|en = 'The tip of the source arrow'"),
		Новый ОписаниеТипов("Строка"),
		ТипыСтрелокКлассовИсточник(),
		Истина);

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"НаконечникПриемника",
		НСтр("ru = 'Наконечник стрелки приемника';
			|en = 'Receiver Arrow Tip'"),
		Новый ОписаниеТипов("Строка"),
		ТипыСтрелокКлассовПриемник(),
		Истина);

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"СтильСтрелки",
		НСтр("ru = 'Стиль линии';
			|en = 'Line Style'"),
		Новый ОписаниеТипов("Строка"),
		СтилиСтрелки());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТолщинаЛинии",
		НСтр("ru = 'Толщина линии';
			|en = 'Line thickness'"),
		Новый ОписаниеТипов("Число"));

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"МеткаИсточник",
		НСтр("ru = 'Метка к источнику';
			|en = 'The label to the source'"),
		Новый ОписаниеТипов("Строка"));

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"МеткаПриемник",
		НСтр("ru = 'Метка к приемнику';
			|en = 'Tag to the receiver'"),
		Новый ОписаниеТипов("Строка"));

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветСтрелки",
		НСтр("ru = 'Цвет линии';
			|en = 'Line color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ВидимостьПоля",
		НСтр("ru = 'Видимость поля/метода';
			|en = 'Field/method visibility'"),
		Новый ОписаниеТипов("Строка"),
		ВариантыВидимостиПолейОбъекта());

КонецПроцедуры // ПолучитьСвойстваСвязиПоследовательностей()

Процедура ПолучитьСвойстваГруппыКлассов(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаКлассов") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветФона",
		НСтр("ru = 'Цвет фона';
			|en = 'Background color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипГруппы",
		НСтр("ru = 'Стиль';
			|en = 'Style'"),
		Новый ОписаниеТипов("Строка"),
		СтилиПакетов());

КонецПроцедуры // ПолучитьСвойстваГруппыКлассов()

#КонецОбласти

#Область ДиаграммаДеятельности

Процедура ПолучитьСвойстваДиаграммыДеятельности(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаДеятельности") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"!pragma useVerticalIf on",
		НСтр("ru = 'Вывести вложенные условия вертикально';
			|en = 'Display nested conditions vertically'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", ""));

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"skinparam ArrowHeadColor none",
		НСтр("ru = 'Вывести стрелки линиями';
			|en = 'Draw arrows with lines'"),
		Новый ОписаниеТипов("Булево"),
		СписокВыбораДаНет("true", ""));

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ФорматКартинкиРезультата",
		НСтр("ru = 'Формат картинки результата';
			|en = 'Result image format'"),
		Новый ОписаниеТипов("Строка"),
		ФорматыКартинкиРезультата());

КонецПроцедуры // ПолучитьСвойстваДиаграммыДеятельности()

Процедура ПолучитьСвойстваОбъектаДеятельности(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаДеятельности") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипОбъекта",
		НСтр("ru = 'Тип объекта (диаграмма деятальности)';
			|en = 'Object type (modality diagram)'"),
		Новый ОписаниеТипов("Строка"),
		ФормыПредставленияДляДиаграммыДеятельности());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветФона",
		НСтр("ru = 'Цвет объекта';
			|en = 'Object color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ВидДействия",
		НСтр("ru = 'Внешний вид действия';
			|en = 'Appearance of the action'"),
		Новый ОписаниеТипов("Строка"),
		ВнешнийВидДействия());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ВидОкончания",
		НСтр("ru = 'Вид окончания';
			|en = 'Type of ending'"),
		Новый ОписаниеТипов("Строка"),
		ВидыОкончанияДиаграммы());

КонецПроцедуры // ПолучитьСвойстваОбъектаДеятельности()

Процедура ПолучитьСвойстваСвязиДеятельности(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаДеятельности") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"СтильСтрелки",
		НСтр("ru = 'Стиль линии';
			|en = 'Line Style'"),
		Новый ОписаниеТипов("Строка"),
		СтилиСтрелки());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветСтрелки",
		НСтр("ru = 'Цвет линии';
			|en = 'Line color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

КонецПроцедуры // ПолучитьСвойстваСвязиДеятельности()

Процедура ПолучитьСвойстваГруппыДеятельности(ТипДиаграммы, Свойства)

	Если Не ТипДиаграммыСовпадает(ТипДиаграммы, "ДиаграммаДеятельности") Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ЦветФона",
		НСтр("ru = 'Цвет фона';
			|en = 'Background color'"),
		Новый ОписаниеТипов("Строка"),
		ОсновныеЦветаДляВыбора());

	ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		"ТипГруппы",
		НСтр("ru = 'Стиль';
			|en = 'Style'"),
		Новый ОписаниеТипов("Строка"),
		СтилиГруппДеятельности());

КонецПроцедуры // ПолучитьСвойстваГруппыДеятельности()

#КонецОбласти

Процедура ДобавитьСвойство(
		Свойства,
		ТипДиаграммы,
		Имя,
		Представление,
		ТипЗначения,
		ДоступныеЗначения = Неопределено,
		ТолькоДоступныеЗначения = Ложь,
		ОграничениеИспользования = Неопределено)

	НоваяСтрока = Свойства.Добавить();
	НоваяСтрока.Свойство = Имя;
	НоваяСтрока.ТипДиаграммы = ТипДиаграммы;
	НоваяСтрока.Наименование = Представление;
	НоваяСтрока.ТипЗначения = ТипЗначения;
	НоваяСтрока.ДоступныеЗначения = ДоступныеЗначения;
	НоваяСтрока.ТолькоДоступныеЗначения = ТолькоДоступныеЗначения;
	НоваяСтрока.ОграничениеИспользования = ОграничениеИспользования;

КонецПроцедуры // ДобавитьСвойство()

Функция СписокВыбораДаНет(ЗначениеДа, ЗначениеНет)

	СписокВыбора = Новый СписокЗначений();
	СписокВыбора.Добавить(ЗначениеДа, НСтр("ru = 'Да';
											|en = 'Yes'"));
	СписокВыбора.Добавить(ЗначениеНет, НСтр("ru = 'Нет';
											|en = 'No'"));

	Возврат СписокВыбора;

КонецФункции // СписокВыбораДаНет()

Функция ОсновныеЦветаДляВыбора()

	Цвета = Новый СписокЗначений();
	Цвета.Добавить("", НСтр("ru = 'Авто';
							|en = 'Auto'"));
	Цвета.Добавить("grey", НСтр("ru = 'Серый';
								|en = 'Gray'"));
	Цвета.Добавить("red", НСтр("ru = 'Красный';
								|en = 'Red'"));
	Цвета.Добавить("blue", НСтр("ru = 'Синий';
								|en = 'Blue'"));
	Цвета.Добавить("green", НСтр("ru = 'Зеленый';
								|en = 'Green'"));
	Цвета.Добавить("yellow", НСтр("ru = 'Желтый';
									|en = 'Yellow'"));

	Возврат Цвета;

КонецФункции // ОсновныеЦветаДляВыбора()

Функция СписокВыбораРасположения()

	Цвета = Новый СписокЗначений();
	Цвета.Добавить("", НСтр("ru = 'Авто';
							|en = 'Auto'"));
	Цвета.Добавить("left", НСтр("ru = 'Лево';
								|en = 'Left'"));
	Цвета.Добавить("right", НСтр("ru = 'Право';
								|en = 'Right'"));
	Цвета.Добавить("center", НСтр("ru = 'Центр';
									|en = 'Centre'"));

	Возврат Цвета;

КонецФункции // СписокВыбораРасположения()

Функция ФормаПредставленияОбъекта() Экспорт

	ФормыПредставления = Новый СписокЗначений();
	ФормыПредставления.Добавить("participant", НСтр("ru = 'Участник';
													|en = 'Participant'"));
	ФормыПредставления.Добавить("actor", НСтр("ru = 'Пользователь (актор)';
												|en = 'The user (actor)'"));
	ФормыПредставления.Добавить("boundary", НСтр("ru = 'Граничный элемент';
												|en = 'Boundary element'"));
	ФормыПредставления.Добавить("control", НСтр("ru = 'Управляющий элемент';
												|en = 'The control element'"));
	ФормыПредставления.Добавить("entity", НСтр("ru = 'Сущность';
												|en = 'Entity'"));
	ФормыПредставления.Добавить("database", НСтр("ru = 'База данных';
												|en = 'The database'"));
	ФормыПредставления.Добавить("collections", НСтр("ru = 'Коллекция';
													|en = 'Collection'"));
	ФормыПредставления.Добавить("queue", НСтр("ru = 'Очередь';
												|en = 'Queue'"));

	Возврат ФормыПредставления;

КонецФункции // ФормаПредставленияОбъекта()

Функция ФормаПредставленияОбъектаКласса() Экспорт

	ФормыПредставления = Новый СписокЗначений();
	ФормыПредставления.Добавить("abstract", НСтр("ru = 'Абстаракция';
												|en = 'Withdrawal symptoms'"));
	ФормыПредставления.Добавить("abstract class", НСтр("ru = 'Абстрактный класс';
														|en = 'Abstract class'"));
	ФормыПредставления.Добавить("annotation", НСтр("ru = 'Аннотация';
													|en = 'Annotation'"));
	ФормыПредставления.Добавить("circle", НСтр("ru = 'Круг';
												|en = 'Circle'"));
//	ФормыПредставления.Добавить("()", НСтр("ru = 'Круг (уменьшенная форма)'"));
	ФормыПредставления.Добавить("class", НСтр("ru = 'Класс';
												|en = 'Class'"));
	ФормыПредставления.Добавить("diamond", НСтр("ru = 'Ассоциация';
												|en = 'Association'"));
//	ФормыПредставления.Добавить("<>", НСтр("ru = 'Ассоциация (уменьшенная форма)'"));
	ФормыПредставления.Добавить("entity", НСтр("ru = 'Сущность';
												|en = 'Entity'"));
	ФормыПредставления.Добавить("enum", НСтр("ru = 'Перечисление';
											|en = 'Enumeration'"));
	ФормыПредставления.Добавить("interface", НСтр("ru = 'Интерфейс';
													|en = 'Interface'"));
	ФормыПредставления.Добавить("protocol", НСтр("ru = 'Протокол';
												|en = 'Protocol'"));
	ФормыПредставления.Добавить("struct", НСтр("ru = 'Структура';
												|en = 'Structure'"));

	Возврат ФормыПредставления;

КонецФункции // ФормаПредставленияОбъектаКласса()

Функция ТипыСтрелок()

	ТипыСтрелокСвязи = Новый СписокЗначений();
	ТипыСтрелокСвязи.Добавить("", НСтр("ru = 'Авто';
										|en = 'Auto'"));
	ТипыСтрелокСвязи.Добавить("->", "->");
	ТипыСтрелокСвязи.Добавить("->>", "->>");
	ТипыСтрелокСвязи.Добавить("-\", "-\");
	ТипыСтрелокСвязи.Добавить("-\\", "-\\");
	ТипыСтрелокСвязи.Добавить("-/", "-/");
	ТипыСтрелокСвязи.Добавить("-//", "-//");
	ТипыСтрелокСвязи.Добавить("->x", "->x");
	ТипыСтрелокСвязи.Добавить("x->", "x->");
	ТипыСтрелокСвязи.Добавить("o->", "o->");
	ТипыСтрелокСвязи.Добавить("->o", "->o");
	ТипыСтрелокСвязи.Добавить("o->o", "o->o");
	ТипыСтрелокСвязи.Добавить("<->", "<->");
	ТипыСтрелокСвязи.Добавить("o<->o", "o<->o");
	ТипыСтрелокСвязи.Добавить("x<->x", "x<->x");
	ТипыСтрелокСвязи.Добавить("->>o", "->>o");
	ТипыСтрелокСвязи.Добавить("-\o", "-\o");
	ТипыСтрелокСвязи.Добавить("-\\o", "-\\o");
	ТипыСтрелокСвязи.Добавить("-/o", "-/o");
	ТипыСтрелокСвязи.Добавить("-//o", "-//o");
	ТипыСтрелокСвязи.Добавить("x->o", "x->o");

	Возврат ТипыСтрелокСвязи;

КонецФункции // ТипыСтрелок()

Функция ТипыСвязейКлассов() Экспорт

	ТипыСвязей = Новый СписокЗначений();
	ТипыСвязей.Добавить("Связь", НСтр("ru = 'Связь';
										|en = 'Connection'"));
	ТипыСвязей.Добавить("Поле", НСтр("ru = 'Поле';
									|en = 'Field'"));
	ТипыСвязей.Добавить("Метод", НСтр("ru = 'Метод';
										|en = 'Method'"));

	Возврат ТипыСвязей;

КонецФункции // ТипыСвязейКлассов()

Функция ТипыСтрелокКлассовИсточник()

	ТипыСтрелокСвязи = Новый СписокЗначений();
	ТипыСтрелокСвязи.Добавить("", НСтр("ru = 'Авто';
										|en = 'Auto'"));
	ТипыСтрелокСвязи.Добавить("<", НСтр("ru = 'Заостренный наконечник';
										|en = 'The pointed tip'"));
	ТипыСтрелокСвязи.Добавить("<|", НСтр("ru = 'Треугольник';
										|en = 'Triangle'"));
	ТипыСтрелокСвязи.Добавить("*", НСтр("ru = 'Ромб';
										|en = 'Rhomb'"));
	ТипыСтрелокСвязи.Добавить("o", НСтр("ru = 'Полый ромб';
										|en = 'Hollow rhombus'"));
	ТипыСтрелокСвязи.Добавить("#", НСтр("ru = 'Полый квадрат';
										|en = 'Hollow Square'"));
	ТипыСтрелокСвязи.Добавить("x", НСтр("ru = 'Крестик';
										|en = 'The cross'"));
	ТипыСтрелокСвязи.Добавить("}", НСтр("ru = 'Обратный треугольник';
										|en = 'The reverse triangle'"));
	ТипыСтрелокСвязи.Добавить("+", НСтр("ru = 'Кружок с крестиком внутри';
										|en = 'A circle with a cross inside'"));

	Возврат ТипыСтрелокСвязи;

КонецФункции // ТипыСтрелокКлассовИсточник()

Функция ТипыСтрелокКлассовПриемник()

	ТипыСтрелокСвязи = Новый СписокЗначений();
	ТипыСтрелокСвязи.Добавить("", НСтр("ru = 'Авто';
										|en = 'Auto'"));
	ТипыСтрелокСвязи.Добавить(">", НСтр("ru = 'Заостренный наконечник';
										|en = 'The pointed tip'"));
	ТипыСтрелокСвязи.Добавить("|>", НСтр("ru = 'Треугольник';
										|en = 'Triangle'"));
	ТипыСтрелокСвязи.Добавить("*", НСтр("ru = 'Ромб';
										|en = 'Rhomb'"));
	ТипыСтрелокСвязи.Добавить("o", НСтр("ru = 'Полый ромб';
										|en = 'Hollow rhombus'"));
	ТипыСтрелокСвязи.Добавить("#", НСтр("ru = 'Полый квадрат';
										|en = 'Hollow Square'"));
	ТипыСтрелокСвязи.Добавить("x", НСтр("ru = 'Крестик';
										|en = 'The cross'"));
	ТипыСтрелокСвязи.Добавить("{", НСтр("ru = 'Обратный треугольник';
										|en = 'The reverse triangle'"));
	ТипыСтрелокСвязи.Добавить("+", НСтр("ru = 'Кружок с крестиком внутри';
										|en = 'A circle with a cross inside'"));

	Возврат ТипыСтрелокСвязи;

КонецФункции // ТипыСтрелокКлассовПриемник()

Функция ВидыСообщений()

	ВидыСообщений = Новый СписокЗначений();
	ВидыСообщений.Добавить("", НСтр("ru = 'Авто';
									|en = 'Auto'"));
	ВидыСообщений.Добавить("[", НСтр("ru = 'Входящее';
									|en = 'Incoming'"));
	ВидыСообщений.Добавить("]", НСтр("ru = 'Исходящее';
									|en = 'Outgoing'"));

	Возврат ВидыСообщений;

КонецФункции // ВидыСообщений()

Функция ТипыАктивизацииОбъектов()

	ТипыАктивизации = Новый СписокЗначений();
	ТипыАктивизации.Добавить("", НСтр("ru = 'Авто';
										|en = 'Auto'"));
	ТипыАктивизации.Добавить("activate", НСтр("ru = 'Активировать';
												|en = 'Activate'"));
	ТипыАктивизации.Добавить("deactivate", НСтр("ru = 'Деактивировать';
												|en = 'Deactivate'"));
	ТипыАктивизации.Добавить("destroy", НСтр("ru = 'Конец существования';
											|en = 'The end of existence'"));

	Возврат ТипыАктивизации;

КонецФункции // ТипыАктивизацииОбъектов()

Функция СтилиПакетов()

	СтилиПакетов = Новый СписокЗначений();
	СтилиПакетов.Добавить("", НСтр("ru = 'Авто';
									|en = 'Auto'"));
	СтилиПакетов.Добавить("Node", НСтр("ru = 'Куб';
										|en = 'Cube'"));
	СтилиПакетов.Добавить("Rectangle", НСтр("ru = 'Прямоугольник';
											|en = 'Rectangle'"));
	СтилиПакетов.Добавить("Folder", НСтр("ru = 'Папка';
										|en = 'Folder'"));
	СтилиПакетов.Добавить("Frame", НСтр("ru = 'Рамка';
										|en = 'Frame'"));
	СтилиПакетов.Добавить("Cloud", НСтр("ru = 'Облако';
										|en = 'Cloud'"));
	СтилиПакетов.Добавить("Database", НСтр("ru = 'База данных';
											|en = 'The database'"));

	Возврат СтилиПакетов;

КонецФункции // СтилиПакетов()

Функция СтилиСтрелки()

	СтилиСтрелки = Новый СписокЗначений();
	СтилиСтрелки.Добавить("", НСтр("ru = 'Авто';
									|en = 'Auto'"));
	СтилиСтрелки.Добавить("bold", НСтр("ru = 'Жирный';
										|en = 'Fat'"));
	СтилиСтрелки.Добавить("dashed", НСтр("ru = 'Штриховой';
										|en = 'Dashed'"));
	СтилиСтрелки.Добавить("dotted", НСтр("ru = 'Пунктирный';
										|en = 'Dotted line'"));
	СтилиСтрелки.Добавить("hidden", НСтр("ru = 'Скрытый';
										|en = 'Hidden'"));
	СтилиСтрелки.Добавить("plain", НСтр("ru = 'Непрерывный';
										|en = 'Continuous'"));

	Возврат СтилиСтрелки;

КонецФункции // СтилиСтрелки()

Функция ВариантыВидимостиПолейОбъекта()

	СтилиСтрелки = Новый СписокЗначений();
	СтилиСтрелки.Добавить("", НСтр("ru = 'Авто';
									|en = 'Auto'"));
	СтилиСтрелки.Добавить("-", НСтр("ru = 'Закрытый';
									|en = 'Private'"));
	СтилиСтрелки.Добавить("#", НСтр("ru = 'Защищенный';
									|en = 'Protected'"));
	СтилиСтрелки.Добавить("~", НСтр("ru = 'Доступный внутри пакета';
									|en = 'Available inside the package'"));
	СтилиСтрелки.Добавить("+", НСтр("ru = 'Общедоступный';
									|en = 'Publicly available'"));

	Возврат СтилиСтрелки;

КонецФункции // ВариантыВидимостиПолейОбъекта()

Функция СтилиГруппДеятельности()

	СтилиГрупп = Новый СписокЗначений();
	СтилиГрупп.Добавить("", НСтр("ru = 'Авто';
								|en = 'Auto'"));
	СтилиГрупп.Добавить("partition", НСтр("ru = 'Раздел';
											|en = 'Chapter'"));
	СтилиГрупп.Добавить("package", НСтр("ru = 'Пакет';
										|en = 'Package'"));
	СтилиГрупп.Добавить("rectangle", НСтр("ru = 'Прямоугольник';
											|en = 'Rectangle'"));
	СтилиГрупп.Добавить("card", НСтр("ru = 'Карточка';
									|en = 'Card'"));

	Возврат СтилиГрупп;

КонецФункции // СтилиГруппДеятельности()

Функция ВнешнийВидДействия()

	ВидДействия = Новый СписокЗначений();
	ВидДействия.Добавить("", НСтр("ru = 'Авто';
									|en = 'Auto'"));
	ВидДействия.Добавить(";", НСтр("ru = 'Состояние';
									|en = 'Condition'"));
	ВидДействия.Добавить("|", НСтр("ru = 'Вызов процедуры';
									|en = 'Procedure call'"));
	ВидДействия.Добавить("<", НСтр("ru = 'Ввод';
									|en = 'Input'"));
	ВидДействия.Добавить(">", НСтр("ru = 'Вывод';
									|en = 'Conclusion'"));
	ВидДействия.Добавить("/", НСтр("ru = 'Сохранение';
									|en = 'Conservation'"));
	ВидДействия.Добавить("]", НСтр("ru = 'Задача';
									|en = 'Task'"));
	ВидДействия.Добавить("}", НСтр("ru = 'Решение';
									|en = 'Decision'"));

	Возврат ВидДействия;

КонецФункции // ВнешнийВидДействия()

Функция ВидыОкончанияДиаграммы()

	ВидДействия = Новый СписокЗначений();
	ВидДействия.Добавить("", НСтр("ru = 'Авто';
									|en = 'Auto'"));
	ВидДействия.Добавить("end", НСтр("ru = 'Конец';
									|en = 'The end'"));
	ВидДействия.Добавить("stop", НСтр("ru = 'Стоп';
										|en = 'Stop'"));

	Возврат ВидДействия;

КонецФункции // ВидыОкончанияДиаграммы()

Функция ФорматыКартинкиРезультата()

	ФорматКартинкиДляРезультата = Новый СписокЗначений();
	ФорматКартинкиДляРезультата.Добавить("", НСтр("ru = 'Авто';
													|en = 'Auto'"));
	ФорматКартинкиДляРезультата.Добавить("PNG", НСтр("ru = 'PNG';
													|en = 'PNG'"));
	ФорматКартинкиДляРезультата.Добавить("SVG", НСтр("ru = 'SVG';
													|en = 'SVG'"));

	Возврат ФорматКартинкиДляРезультата;

КонецФункции // ФорматыКартинкиРезультата()

Функция ФормыПредставленияДляДиаграммыДеятельности() Экспорт

	ФормыПредставления = Новый СписокЗначений();
	ФормыПредставления.Добавить("start", НСтр("ru = 'Старт';
												|en = 'Start'"));
	ФормыПредставления.Добавить("do", НСтр("ru = 'Действие';
											|en = 'Action'"));
	ФормыПредставления.Добавить("if", НСтр("ru = 'Условие (if)';
											|en = 'Condition (if)'"));
	ФормыПредставления.Добавить("switch", НСтр("ru = 'Условие (switch)';
												|en = 'Condition (switch)'"));
	ФормыПредставления.Добавить("while", НСтр("ru = 'Цикл (while)';
												|en = 'Loop (while)'"));
	ФормыПредставления.Добавить("break", НСтр("ru = 'Прервать цикл (break)';
												|en = 'Break the cycle'"));
	ФормыПредставления.Добавить("fork", НСтр("ru = 'Паралелльное выполнение';
											|en = 'Parallel execution'"));
	ФормыПредставления.Добавить("end", НСтр("ru = 'Конец';
											|en = 'The end'"));

	Возврат ФормыПредставления;

КонецФункции // ФормыПредставленияДляДиаграммыДеятельности()

#КонецОбласти

#КонецЕсли
